docs: replace plantuml with mermaid
